<?php 
return [
	// Идентификатор модуля (для внедения в админпанель и назначение имени иконки с расширением .png)
	'moduleName'    => 'dle_starter',
	
	// Название модуля - показывается как в установщике, так и в админке.
	'moduleTitle'   => 'DLE Starter',
	
	// Описание модуля, для установщика и админки.
	'moduleDescr'   => 'Модуль-пример для работы с DLE Starter Kit',
	
	// Версия модуля, для установщика
	'moduleVersion' => '1.0.0',
	
	// Дата выпуска модуля, для установщика
	'moduleDate'    => '24.09.2016',
	
	// Версии DLE, поддержваемые модулем, для установщика
	'dleVersion'    => '11.x',
	
	// Устанавливать админку (true/false). Включает показ кнопки установки и удаления админки.
	'installAdmin'  => true,
	
	// ID групп, для которых доступно управление модулем в админке.
	'allowGroups'   => '1',
];